Revit 2026 API

# BuiltInFailuresLooseDimensionFailures Class

---

Failures about LooseDimension.

SystemObject Autodesk.Revit.DBBuiltInFailuresLooseDimensionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class LooseDimensionFailures
```
```vb
Public NotInheritable Class LooseDimensionFailures
```
```cpp
public ref class LooseDimensionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type LooseDimensionFailures = class end
```

The BuiltInFailuresLooseDimensionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LooseCurtainWallData | Switching element type to a non-Curtain element Family type. All data about Mullions, Grid Lines, and design units for the Curtain element will be lost. |
|  | LooseDimensionsForCurtainWall | Switching wall type to Family Curtain Wall. All Dimension References to the side faces of the Wall will be deleted. |
|  | LooseFaceSplitsForCurtainWall | Switching element type to Curtain Family. All Split Face Regions in the element will be deleted. |
|  | LooseInsertsForCurtainWall | Switching element type to Curtain element. All inserts in the element will be deleted. |
|  | LooseWallsweepsForCurtainWall | Switching element type to Curtain Family. All Wall Sweeps or Reveals hosted by this instance will be deleted. |

#### Reference

Autodesk.Revit.DB Namespace